cubo_rp/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

foamCleanCase

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="$(getApplication)"

runApplication blockMesh #-dict $FOAM_TUTORIALS/resources/blockMesh/pitzDaily
runApplication $application

#------------------------------------------------------------------------------
